; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=92, out_folder=htg/blocksworld/training, instance_id=72, seed=2096, goal_proportion=0.1

(define (problem blocksworld-72)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 - object)
 (:init 
    (arm-empty)
    (clear b1)
    (on-table b1)
    (clear b53)
    (on b53 b8)
    (on b8 b64)
    (on b64 b6)
    (on b6 b16)
    (on b16 b43)
    (on b43 b65)
    (on b65 b87)
    (on b87 b49)
    (on b49 b75)
    (on b75 b24)
    (on b24 b74)
    (on b74 b73)
    (on b73 b60)
    (on b60 b45)
    (on b45 b47)
    (on b47 b58)
    (on b58 b32)
    (on b32 b2)
    (on b2 b29)
    (on b29 b67)
    (on b67 b9)
    (on b9 b11)
    (on b11 b48)
    (on b48 b35)
    (on b35 b57)
    (on b57 b63)
    (on b63 b52)
    (on b52 b61)
    (on-table b61)
    (clear b86)
    (on b86 b25)
    (on b25 b90)
    (on b90 b46)
    (on b46 b88)
    (on b88 b84)
    (on-table b84)
    (clear b23)
    (on b23 b4)
    (on b4 b38)
    (on b38 b71)
    (on-table b71)
    (clear b76)
    (on b76 b30)
    (on b30 b41)
    (on b41 b36)
    (on b36 b50)
    (on b50 b70)
    (on b70 b77)
    (on b77 b59)
    (on-table b59)
    (clear b91)
    (on b91 b44)
    (on b44 b22)
    (on b22 b51)
    (on b51 b14)
    (on b14 b15)
    (on b15 b62)
    (on b62 b5)
    (on b5 b68)
    (on b68 b33)
    (on b33 b17)
    (on b17 b72)
    (on b72 b80)
    (on b80 b10)
    (on b10 b78)
    (on b78 b21)
    (on b21 b54)
    (on b54 b79)
    (on b79 b12)
    (on b12 b82)
    (on b82 b34)
    (on b34 b19)
    (on b19 b20)
    (on b20 b28)
    (on b28 b56)
    (on b56 b27)
    (on b27 b89)
    (on b89 b18)
    (on b18 b7)
    (on b7 b39)
    (on b39 b92)
    (on b92 b42)
    (on b42 b31)
    (on b31 b26)
    (on b26 b66)
    (on b66 b55)
    (on-table b55)
    (clear b69)
    (on b69 b40)
    (on b40 b37)
    (on b37 b85)
    (on b85 b81)
    (on b81 b83)
    (on b83 b13)
    (on b13 b3)
    (on-table b3))
 (:goal  (and 
    (clear b3)
    (on b3 b6)
    (on b6 b5)
    (on-table b5)
    (clear b4)
    (on b4 b7)
    (on b7 b1)
    (on b1 b9)
    (on b9 b8)
    (on-table b8)
    (clear b2)
    (on-table b2))))

; plan
1. (unstack b23 b4)
   deleted: (on b23 b4) (clear b23) (arm-empty)
   added: (holding b23) (clear b4)
   goals met: 1 of 12
2. (putdown b23)
   deleted: (holding b23)
   added: (clear b23) (arm-empty) (on-table b23)
   goals met: 1 of 12
3. (unstack b53 b8)
   deleted: (on b53 b8) (clear b53) (arm-empty)
   added: (holding b53) (clear b8)
   goals met: 1 of 12
4. (putdown b53)
   deleted: (holding b53)
   added: (clear b53) (arm-empty) (on-table b53)
   goals met: 1 of 12
5. (unstack b8 b64)
   deleted: (on b8 b64) (clear b8) (arm-empty)
   added: (holding b8) (clear b64)
   goals met: 1 of 12
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 2 of 12
7. (unstack b91 b44)
   deleted: (on b91 b44) (clear b91) (arm-empty)
   added: (holding b91) (clear b44)
   goals met: 2 of 12
8. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 2 of 12
9. (unstack b69 b40)
   deleted: (on b69 b40) (clear b69) (arm-empty)
   added: (holding b69) (clear b40)
   goals met: 2 of 12
10. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 2 of 12
11. (unstack b40 b37)
   deleted: (on b40 b37) (clear b40) (arm-empty)
   added: (holding b40) (clear b37)
   goals met: 2 of 12
12. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 2 of 12
13. (unstack b37 b85)
   deleted: (on b37 b85) (clear b37) (arm-empty)
   added: (holding b37) (clear b85)
   goals met: 2 of 12
14. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 2 of 12
15. (unstack b85 b81)
   deleted: (on b85 b81) (clear b85) (arm-empty)
   added: (holding b85) (clear b81)
   goals met: 2 of 12
16. (putdown b85)
   deleted: (holding b85)
   added: (clear b85) (arm-empty) (on-table b85)
   goals met: 2 of 12
17. (unstack b81 b83)
   deleted: (on b81 b83) (clear b81) (arm-empty)
   added: (holding b81) (clear b83)
   goals met: 2 of 12
18. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 2 of 12
19. (unstack b83 b13)
   deleted: (on b83 b13) (clear b83) (arm-empty)
   added: (holding b83) (clear b13)
   goals met: 2 of 12
20. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 2 of 12
21. (unstack b13 b3)
   deleted: (on b13 b3) (clear b13) (arm-empty)
   added: (holding b13) (clear b3)
   goals met: 3 of 12
22. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 3 of 12
23. (unstack b64 b6)
   deleted: (on b64 b6) (clear b64) (arm-empty)
   added: (holding b64) (clear b6)
   goals met: 3 of 12
24. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 3 of 12
25. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 2 of 12
26. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 4 of 12
27. (unstack b44 b22)
   deleted: (on b44 b22) (clear b44) (arm-empty)
   added: (holding b44) (clear b22)
   goals met: 4 of 12
28. (putdown b44)
   deleted: (holding b44)
   added: (clear b44) (arm-empty) (on-table b44)
   goals met: 4 of 12
29. (unstack b22 b51)
   deleted: (on b22 b51) (clear b22) (arm-empty)
   added: (holding b22) (clear b51)
   goals met: 4 of 12
30. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 4 of 12
31. (unstack b51 b14)
   deleted: (on b51 b14) (clear b51) (arm-empty)
   added: (holding b51) (clear b14)
   goals met: 4 of 12
32. (putdown b51)
   deleted: (holding b51)
   added: (clear b51) (arm-empty) (on-table b51)
   goals met: 4 of 12
33. (unstack b14 b15)
   deleted: (on b14 b15) (clear b14) (arm-empty)
   added: (holding b14) (clear b15)
   goals met: 4 of 12
34. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 4 of 12
35. (unstack b15 b62)
   deleted: (on b15 b62) (clear b15) (arm-empty)
   added: (holding b15) (clear b62)
   goals met: 4 of 12
36. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 4 of 12
37. (unstack b62 b5)
   deleted: (on b62 b5) (clear b62) (arm-empty)
   added: (holding b62) (clear b5)
   goals met: 4 of 12
38. (putdown b62)
   deleted: (holding b62)
   added: (clear b62) (arm-empty) (on-table b62)
   goals met: 4 of 12
39. (unstack b5 b68)
   deleted: (on b5 b68) (clear b5) (arm-empty)
   added: (holding b5) (clear b68)
   goals met: 4 of 12
40. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 5 of 12
41. (unstack b68 b33)
   deleted: (on b68 b33) (clear b68) (arm-empty)
   added: (holding b68) (clear b33)
   goals met: 5 of 12
42. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 5 of 12
43. (unstack b33 b17)
   deleted: (on b33 b17) (clear b33) (arm-empty)
   added: (holding b33) (clear b17)
   goals met: 5 of 12
44. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 5 of 12
45. (unstack b17 b72)
   deleted: (on b17 b72) (clear b17) (arm-empty)
   added: (holding b17) (clear b72)
   goals met: 5 of 12
46. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 5 of 12
47. (unstack b72 b80)
   deleted: (on b72 b80) (clear b72) (arm-empty)
   added: (holding b72) (clear b80)
   goals met: 5 of 12
48. (putdown b72)
   deleted: (holding b72)
   added: (clear b72) (arm-empty) (on-table b72)
   goals met: 5 of 12
49. (unstack b80 b10)
   deleted: (on b80 b10) (clear b80) (arm-empty)
   added: (holding b80) (clear b10)
   goals met: 5 of 12
50. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 5 of 12
51. (unstack b10 b78)
   deleted: (on b10 b78) (clear b10) (arm-empty)
   added: (holding b10) (clear b78)
   goals met: 5 of 12
52. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 5 of 12
53. (unstack b78 b21)
   deleted: (on b78 b21) (clear b78) (arm-empty)
   added: (holding b78) (clear b21)
   goals met: 5 of 12
54. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 5 of 12
55. (unstack b21 b54)
   deleted: (on b21 b54) (clear b21) (arm-empty)
   added: (holding b21) (clear b54)
   goals met: 5 of 12
56. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 5 of 12
57. (unstack b54 b79)
   deleted: (on b54 b79) (clear b54) (arm-empty)
   added: (holding b54) (clear b79)
   goals met: 5 of 12
58. (putdown b54)
   deleted: (holding b54)
   added: (clear b54) (arm-empty) (on-table b54)
   goals met: 5 of 12
59. (unstack b79 b12)
   deleted: (on b79 b12) (clear b79) (arm-empty)
   added: (holding b79) (clear b12)
   goals met: 5 of 12
60. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 5 of 12
61. (unstack b12 b82)
   deleted: (on b12 b82) (clear b12) (arm-empty)
   added: (holding b12) (clear b82)
   goals met: 5 of 12
62. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 5 of 12
63. (unstack b82 b34)
   deleted: (on b82 b34) (clear b82) (arm-empty)
   added: (holding b82) (clear b34)
   goals met: 5 of 12
64. (putdown b82)
   deleted: (holding b82)
   added: (clear b82) (arm-empty) (on-table b82)
   goals met: 5 of 12
65. (unstack b34 b19)
   deleted: (on b34 b19) (clear b34) (arm-empty)
   added: (holding b34) (clear b19)
   goals met: 5 of 12
66. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 5 of 12
67. (unstack b19 b20)
   deleted: (on b19 b20) (clear b19) (arm-empty)
   added: (holding b19) (clear b20)
   goals met: 5 of 12
68. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 5 of 12
69. (unstack b20 b28)
   deleted: (on b20 b28) (clear b20) (arm-empty)
   added: (holding b20) (clear b28)
   goals met: 5 of 12
70. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 5 of 12
71. (unstack b28 b56)
   deleted: (on b28 b56) (clear b28) (arm-empty)
   added: (holding b28) (clear b56)
   goals met: 5 of 12
72. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 5 of 12
73. (unstack b56 b27)
   deleted: (on b56 b27) (clear b56) (arm-empty)
   added: (holding b56) (clear b27)
   goals met: 5 of 12
74. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 5 of 12
75. (unstack b27 b89)
   deleted: (on b27 b89) (clear b27) (arm-empty)
   added: (holding b27) (clear b89)
   goals met: 5 of 12
76. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 5 of 12
77. (unstack b89 b18)
   deleted: (on b89 b18) (clear b89) (arm-empty)
   added: (holding b89) (clear b18)
   goals met: 5 of 12
78. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 5 of 12
79. (unstack b18 b7)
   deleted: (on b18 b7) (clear b18) (arm-empty)
   added: (holding b18) (clear b7)
   goals met: 5 of 12
80. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 5 of 12
81. (unstack b7 b39)
   deleted: (on b7 b39) (clear b7) (arm-empty)
   added: (holding b7) (clear b39)
   goals met: 5 of 12
82. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 6 of 12
83. (unstack b4 b38)
   deleted: (on b4 b38) (clear b4) (arm-empty)
   added: (holding b4) (clear b38)
   goals met: 5 of 12
84. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 7 of 12
85. (unstack b3 b6)
   deleted: (on b3 b6) (clear b3) (arm-empty)
   added: (holding b3) (clear b6)
   goals met: 5 of 12
86. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 6 of 12
87. (unstack b6 b16)
   deleted: (on b6 b16) (clear b6) (arm-empty)
   added: (holding b6) (clear b16)
   goals met: 6 of 12
88. (stack b6 b5)
   deleted: (clear b5) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b5)
   goals met: 7 of 12
89. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 6 of 12
90. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 8 of 12
91. (unstack b16 b43)
   deleted: (on b16 b43) (clear b16) (arm-empty)
   added: (holding b16) (clear b43)
   goals met: 8 of 12
92. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 8 of 12
93. (unstack b43 b65)
   deleted: (on b43 b65) (clear b43) (arm-empty)
   added: (holding b43) (clear b65)
   goals met: 8 of 12
94. (putdown b43)
   deleted: (holding b43)
   added: (clear b43) (arm-empty) (on-table b43)
   goals met: 8 of 12
95. (unstack b65 b87)
   deleted: (on b65 b87) (clear b65) (arm-empty)
   added: (holding b65) (clear b87)
   goals met: 8 of 12
96. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 8 of 12
97. (unstack b87 b49)
   deleted: (on b87 b49) (clear b87) (arm-empty)
   added: (holding b87) (clear b49)
   goals met: 8 of 12
98. (putdown b87)
   deleted: (holding b87)
   added: (clear b87) (arm-empty) (on-table b87)
   goals met: 8 of 12
99. (unstack b49 b75)
   deleted: (on b49 b75) (clear b49) (arm-empty)
   added: (holding b49) (clear b75)
   goals met: 8 of 12
100. (putdown b49)
   deleted: (holding b49)
   added: (clear b49) (arm-empty) (on-table b49)
   goals met: 8 of 12
101. (unstack b75 b24)
   deleted: (on b75 b24) (clear b75) (arm-empty)
   added: (holding b75) (clear b24)
   goals met: 8 of 12
102. (putdown b75)
   deleted: (holding b75)
   added: (clear b75) (arm-empty) (on-table b75)
   goals met: 8 of 12
103. (unstack b24 b74)
   deleted: (on b24 b74) (clear b24) (arm-empty)
   added: (holding b24) (clear b74)
   goals met: 8 of 12
104. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 8 of 12
105. (unstack b74 b73)
   deleted: (on b74 b73) (clear b74) (arm-empty)
   added: (holding b74) (clear b73)
   goals met: 8 of 12
106. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 8 of 12
107. (unstack b73 b60)
   deleted: (on b73 b60) (clear b73) (arm-empty)
   added: (holding b73) (clear b60)
   goals met: 8 of 12
108. (putdown b73)
   deleted: (holding b73)
   added: (clear b73) (arm-empty) (on-table b73)
   goals met: 8 of 12
109. (unstack b60 b45)
   deleted: (on b60 b45) (clear b60) (arm-empty)
   added: (holding b60) (clear b45)
   goals met: 8 of 12
110. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 8 of 12
111. (unstack b45 b47)
   deleted: (on b45 b47) (clear b45) (arm-empty)
   added: (holding b45) (clear b47)
   goals met: 8 of 12
112. (putdown b45)
   deleted: (holding b45)
   added: (clear b45) (arm-empty) (on-table b45)
   goals met: 8 of 12
113. (unstack b47 b58)
   deleted: (on b47 b58) (clear b47) (arm-empty)
   added: (holding b47) (clear b58)
   goals met: 8 of 12
114. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 8 of 12
115. (unstack b58 b32)
   deleted: (on b58 b32) (clear b58) (arm-empty)
   added: (holding b58) (clear b32)
   goals met: 8 of 12
116. (putdown b58)
   deleted: (holding b58)
   added: (clear b58) (arm-empty) (on-table b58)
   goals met: 8 of 12
117. (unstack b32 b2)
   deleted: (on b32 b2) (clear b32) (arm-empty)
   added: (holding b32) (clear b2)
   goals met: 9 of 12
118. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 9 of 12
119. (unstack b2 b29)
   deleted: (on b2 b29) (clear b2) (arm-empty)
   added: (holding b2) (clear b29)
   goals met: 8 of 12
120. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 10 of 12
121. (unstack b29 b67)
   deleted: (on b29 b67) (clear b29) (arm-empty)
   added: (holding b29) (clear b67)
   goals met: 10 of 12
122. (putdown b29)
   deleted: (holding b29)
   added: (clear b29) (arm-empty) (on-table b29)
   goals met: 10 of 12
123. (unstack b67 b9)
   deleted: (on b67 b9) (clear b67) (arm-empty)
   added: (holding b67) (clear b9)
   goals met: 10 of 12
124. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 10 of 12
125. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 10 of 12
126. (stack b9 b8)
   deleted: (clear b8) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b8)
   goals met: 11 of 12
127. (unstack b4 b7)
   deleted: (on b4 b7) (clear b4) (arm-empty)
   added: (holding b4) (clear b7)
   goals met: 9 of 12
128. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 10 of 12
129. (unstack b7 b1)
   deleted: (on b7 b1) (clear b7) (arm-empty)
   added: (holding b7) (clear b1)
   goals met: 9 of 12
130. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 9 of 12
131. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 9 of 12
132. (stack b1 b9)
   deleted: (clear b9) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b9)
   goals met: 10 of 12
133. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 10 of 12
134. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 11 of 12
135. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 10 of 12
136. (stack b4 b7)
   deleted: (clear b7) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b7)
   goals met: 12 of 12
